<template>
  <div class="p-5">
    <div class="card-box p-5 ">
      <h1>devops</h1>
      1. 为啥用它？
      优化长列表，之渲染可视化区域，不需要渲染全部的dom从而提升性能
      2.和普通滚动相比，dom渲染变少，适用于大数据场景，但是显示复杂
      3.瓶颈
      滚动事件的触发(可以通过节流来控制事件触发，一段事件只触发一次)
      dom的增加和减少，会导致页面重排消耗性能
      4.拓展：如何实现动态高度的虚拟滚动？
      5.关于重绘重排的相关概念记录
      6.页面优化的可能
    </div>

    <div class="card-box p-5 mt-5">
      一站式企业级持续集成持续交付解决方案，
      提供代码管理、持续集成、持续发布等过程工具，
      并通过流水线实现整个流程的自动化；做到业务应用代码提交后，
      即可根据配置自动化完成 CI/CD过程，最终发布上线。
    </div>
    <div class="card-box p-5 mt-5">
      开箱即用
      平台自身提供代码管理、编译构建、流水线等开发交付过程工具链与环境，无需用户自行搭建与维护，真正做到开箱即用。
      一站式系统集成
      各系统间无缝融合，一套统一认证账号，打通开发交付各环节的数据流转，真正做到一站式DevOps。
      多租户
      适应企业级组织、团队、用户的组织架构模式。支持以组织和团队为单位进行数据隔离，并支持平台共享资源配额限制。
      容器化快速上云
      通过简化的配置步骤，将代码或者介质迅速构建打包为容器镜像，并发布到容器管理平台。降低了传统应用容器化上云的难度，提升了上云效率。
      功能优势


      代码管理
      基于Git的代码托管服务，提供分支管理、版本管理、安全认证等功能

      环境管理
      管理开发交付过程中环境信息，支持环境分组，支持自定义容器环境与虚拟机环境

      编译构建
      内置常用语言编译脚本以及构建环境，根据配置自动切换编译构建环境，支持容器镜像构建

      流水线
      将应用持续集成与发布的流程串接并自动化执行。支持灵活的串并行图形化编排

      部署发布
      支持多形态、多方式的应用自动化部署与发布，满足业务应用持续交付需求

      制品管理
      存储与管理开发交付过程中的制品，实现镜像与通用二进制介质的上传与下载
    </div>
    <div class="card-box p-5 mt-5">
      亮点之外还可以说的：
      环境变量的页面，首页统计数据首次接触到echarts，流水线mxgraph，对项目进行二次进阶，流水线拓扑图表单拓展，封装组件一定要具有可拓展性
      日志请求字符相关，由于日志过多导致每次请求的字符有限，每次请求2048个字符，可展示区域有2m的空间，因此超过2m的就需要吧上边一部分的字符去掉之后重新请求新的2048的字符
      最终导致新的2m内容和之前2m的内容有可能高度不一致导致实际显示的可能不同，因此最终才用虚拟列表，直接按照行数请求避免了这个问题的产生

    </div>
  </div>
</template>
<script lang="ts" setup>

import {ref} from 'vue';

const name = ref<string>("fjw");

</script>
